YairSinger/inventoryMeshBoxs/components/imb_ble/test/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash (16 MB N16R8)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM (8 MB OPI)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Bluetooth — NimBLE only (no Bluedroid)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_MAX_CCCDS=8
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y

# Security: LE Secure Connections + bonding (matches imb_ble.c sm_ config)
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SM_BONDING=y

# NVS (required by NimBLE bond store)
CONFIG_NVS_ENABLED=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
